class DuaData {
  static List<Map<String, String>> data = [

    {
      "title": "الدعاء الأول",
      "dua": """
رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا ۖ وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ
""",
      "ref": "﴿ آل عمران: 8 ﴾"
    },

    {
      "title": "الدعاء الثاني",
      "dua": """
رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً ۖ وَفِي الْآخِرَةِ حَسَنَةً ۖ وَقِنَا عَذَابَ النَّارِ
""",
      "ref": "﴿ البقرة: 201 ﴾"
    },

    {
      "title": "الدعاء الثالث",
      "dua": """
رَبِّ اشْرَحْ لِي صَدْرِي ۝ وَيَسِّرْ لِي أَمْرِي ۝ وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي ۝ يَفْقَهُوا قَوْلِي
""",
      "ref": "﴿ طه: 25-28 ﴾"
    },

    {
      "title": "الدعاء الرابع",
      "dua": """
رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ ۖ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا ۖ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۖ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا
""",
      "ref": "﴿ نوح: 28 ﴾"
    },

    {
      "title": "الدعاء الخامس",
      "dua": """
رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا ۖ وَتَوَفَّنَا مُسْلِمِينَ
""",
      "ref": "﴿ الأعراف: 126 ﴾"
    },

    {
      "title": "الدعاء السادس",
      "dua": """
رَبِّ زِدْنِي عِلْمًا
""",
      "ref": "﴿ طه: 114 ﴾"
    },

    {
      "title": "الدعاء السابع",
      "dua": """
رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ
""",
      "ref": "﴿ الممتحنة: 5 ﴾"
    },

    {
      "title": "الدعاء الثامن",
      "dua": """
رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ
""",
      "ref": "﴿ الممتحنة: 4 ﴾"
    },

    {
      "title": "الدعاء التاسع",
      "dua": """
رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ ۖ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ ۖ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ
""",
      "ref": "﴿ النمل: 19 ﴾"
    },

    {
      "title": "الدعاء العاشر",
      "dua": """
رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا ۖ وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
""",
      "ref": "﴿ آل عمران: 147 ﴾"
    },

  ];
}