class HadithData {
static List<Map<String, String>> data = [

{
"title": "📜 الحديث الأول",
"hadith": """
عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال:
سمعت رسول الله ﷺ يقول:
"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه"
""",
"rawi": "👤 الراوي: عمر بن الخطاب رضي الله عنه",
"source": "📚 صحيح البخاري (1) - صحيح مسلم (1907)"
},
  {
    "title": "📜 الحديث الثاني",
    "hadith": """
«عن عمر رضي الله تعالى عنه أيضاً قال: بينما نحن جلوس عند رسول الله صلى الله عليه وآله وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد، حتى جلس إلى النبي صلى الله عليه وآله وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال: يا محمد أخبرني عن الإسلام،فقال رسول الله صلى الله عليه وآله وسلم: الإسلام أن تشهد أن لا إله إلا الله وأن محمداً رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلاً قال: صدقت، فعجبنا له يسأله ويصدقه.
قال: فأخبرني عن الإيمان، قال أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره، قال: صدقت، قال: فأخبرني عن الإحسان، قال أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك،قال: فأخبرني عن الساعة، قال ما المسئول عنها بأعلم من السائل، قال: فأخبرني عن أماراتها، قال أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ثم انطلق فلبثت ملياً ثم قال يا عمر أتدري من السائل؟ قلت: الله ورسوله أعلم، قال فإنه جبريل أتاكم يعلمكم دينكم» ."
""",
    "rawi": "👤 الراوي: عمر بن الخطاب رضي الله عنه",
    "source": "📚  - صحيح مسلم (8)"
  },
  {
    "title": "📜 الحديث الثالث",
    "hadith": """
    «عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله تعالى عنهما قال: سمعت رسول الله صلى الله عليه وآله وسلم يقول: بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان» .
""",
    "rawi": "👤 الراوي: عبد الله بن عمر بن الخطاب رضي الله عنهما",
    "source": "📚 صحيح البخاري (16) - صحيح مسلم (8)"
  },
  {
    "title": "📜 الحديث الرابع",
    "hadith": """فو الله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها، وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها»«عن أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وآله وسلم وهو الصادق المصدوق: إن أحدكم يجمع خلقه في بطن أمه أربعين يوماً نطفة، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أو سعيد،""",
    "rawi": "👤 الراوي: عبد الله بن مسعود رضي الله عنه",
    "source": "📚 صحيح البخاري (3208) - صحيح مسلم (2643)"
  },
  {
    "title": "📜 الحديث الخامس",
    "hadith": """«عن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وآله وسلم: من أحدث في أمرنا هذا ما ليس منه فهو رد» .
وفي رواية لمسلم «من عمل عملاً ليس عليه أمرنا فهو""",
    "rawi": "👤 الراوي:عائشة بنت أبي بكر رضي الله عنها",
    "source": "📚 صحيح البخاري (2697) - صحيح مسلم (1718)"
  },
  {
    "title": "📜 الحديث السادس",
    "hadith": """«عن أبي عبد الله النعمان بن بشير رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وآله وسلم يقول: إن الحلال بين وإن الحرام بين وبينهما أمور مشتبهات لا يعلمهن كثير من الناس، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام كالراعي يرعى حول الحمى يوشك أن يرتع فيه، ألا وإن لكل ملك حمى، ألا وإن حمى الله محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله وإذا فسدت فسد الجسد كله ألا وهي القلب» .""",
    "rawi": "👤 الراوي: النعمان بن بشير رضي الله عنهما",
    "source": "📚 صحيح البخاري (52) - صحيح مسلم (1599)"
  },
  {
    "title": "📜 الحديث السابع",
    "hadith": """«عن أبي رقية تميم بن أوس الداري رضي الله تعالى عنه أن النبي صلى الله عليه وآله وسلم قال الدين النصيحة.

قلنا: لمن؟ قال لله، ولكتابه، ولرسوله، ولأئمة المسلمين وعامتهم» .""",
    "rawi": "👤 الراوي: تميم بن أوس الداري رضي الله عنه ",

    "source": "📚  صحيح مسلم (55)"
  },
  {
    "title": "📜 الحديث الثامن",
    "hadith": """«عن ابن عمر رضي الله تعالى عنهما أن رسول الله صلى الله تعالى عليه وعلى آله وسلم قال أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمداً رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة: فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله تعالى» .""",
    "rawi": "👤 الراوي: عبد الله بن عمر بن الخطاب رضي الله عنهما",
    "source": "📚 صحيح البخاري (25) - صحيح مسلم (22)"
  },
  {
    "title": "📜 الحديث التاسع",
    "hadith": """«عن أبي هريرة عبد الرحمن بن صخر رضي الله تعالى عنه قال: سمعت رسول الله صلى الله عليه وآله وسلم يقول مانهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم» .""",
    "rawi": "👤 الراوي: أبو هريرة واسمه عبد الرحمن بن صخر رضي الله عنه",
    "source": "📚 صحيح البخاري (7288) - صحيح مسلم (1337)"
  },
{
"title": "📜 الحديث العاشر",
"hadith": """«عن أبي هريرة رضي الله تعالى عنه قال: قال رسول الله صلى الله عليه وآله وسلم: إن الله تعالى طيب لا يقبل إلا طيباً، وإن الله أمر المؤمنين بما أمر به المرسلين فقال تعالى {يا أيها الرسل كلوا من الطيبات واعملوا صالحا} وقال تعالى {يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم} ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء: يا رب يا رب، ومطعمه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب له» . """,
"rawi": "👤 الراوي: أبو هريرة واسمه عبد الرحمن بن صخر رضي الله عنه",
"source": "📚  صحيح مسلم (1015)"
},
// 🔥 تقدر تكمل باقي الأحاديث هنا بنفس الشكل
];
}